content/cv.org
#+TITLE: Curriculum Vitae | Anand Deopurkar
#+AUTHOR: [[mailto:anand.deopurkar@anu.edu.au][~anand.deopurkar@anu.edu.au~]] \(\quad\) [[https://www.ananddeopurkar.org][~ananddeopurkar.org~]]
#+DESCRIPTION: Curriculum vitae of Anand Deopurkar
#+KEYWORDS: Curriculum vitae CV Anand Deopurkar
#+options: -:t broken-links:mark num:nil toc:nil date:nil
#+LATEX_HEADER: \usepackage[margin=3cm]{geometry}
#+LATEX_HEADER_EXTRA: \hypersetup{hidelinks,colorlinks=false,urlcolor=black}
#+LATEX_HEADER_EXTRA: \usepackage{Baskervaldx}
#+LATEX_HEADER_EXTRA: \usepackage{marvosym}
#+HTML_HEAD_EXTRA: <script src="js/collapsibility.js"></script>

* Positions
:PROPERTIES:
:html_headline_class: collapsible
:END:
#+RESULTS:
:results:
- 2021-- :: Senior lecturer\\
      Australian National University, Canberra, Australia.
- 2018--2020 :: Lecturer\\
      Australian National University, Canberra, Australia.
- 2016--2017 :: Assistant professor (limited term)\\
      University of Georgia, Athens, Georgia, USA.
- 2012--2016 :: J. F. Ritt assistant professor\\
      Columbia University, New York City, New York, USA.
- 2008 :: Summer intern\\
      Microsoft Research, Bangalore, India.
:end:

* Education
:PROPERTIES:
:html_headline_class: collapsible
:END:
#+RESULTS:
:results:
- 2012 :: Ph.D.\\
 Harvard University, Cambridge, Massachusetts, USA.\\
       /Alternate compactifications of Hurwitz spaces/, advisor: Joseph Harris.
- 2008 :: Bachelor of Science (S.B.)\\
 Massachusetts Institute of Technology, Cambridge, Massachusetts, USA.\\
       Mathematics with computer science.
:end:

* Grants and awards
:PROPERTIES:
:html_headline_class: collapsible
:END:
#+begin_src elisp :exports results :results value raw drawer
  ;; Our pretty-printing function
  (let ((previous ""))
    (defun pretty-print ()
      (let ((title (org-entry-get nil "ITEM"))
  	  (org (org-entry-get nil "org"))
  	  (collaborators (org-entry-get nil "with"))
  	  (year (org-entry-get nil "year")))
        (format "- %s :: %s, %s%s."
  	      (if (equal previous year)
                    "---"
  		(setq previous year))
  	    title
  	    org
  	    (if collaborators
  		(format " (with %s)" collaborators)
  	      "")
  	    )))
    (string-join (org-map-entries 'pretty-print "-nocv" '("#awards.org")) "\n"))
#+end_src

#+RESULTS:
:results:
- 2024 :: Discovery project award (DP), Australian Research Council (with Asilata Bapat, Anthony Licata).
- 2018 :: Discovery early career researcher award (DECRA), Australian Research Council.
- 2016 :: AMS-Simons travel grant, American Mathematical Society and Simons Foundation.
- --- :: Workshop funding, American Institute of Mathematics (with Maksym Fedorchuk, Ian Morrison, Xiaowei Wang).
- 2014 :: Award for excellence in teaching, Columbia University, Mathematics department.
- 2006 :: Jon A. Bucsela prize for the top undergraduate, Massachusetts Institute of Technology, Mathematics department.
- --- :: Rogers family prize for undergraduate summer research, Massachusetts Institute of Technology, Mathematics department.
- 2007, 2005, 2004 :: Honorable mention (2004) , honorable mention (2005), rank 16--25 (2004), William Lowell Putnam competition.
:end:

