docs/cv.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-04-12 Sat 09:10 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Curriculum Vitae | Anand Deopurkar</title>
<meta name="author" content="[[mailto:anand.deopurkar@anu.edu.au][~anand.deopurkar@anu.edu.au~]] \(\quad\) [[https://www.ananddeopurkar.org][~ananddeopurkar.org~]]" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/css/main.css"><link href="https://fonts.googleapis.com/css2?family=Atkinson+Hyperlegible:ital,wght@0,400;0,700;1,400;1,700&family=B612:wght@300..700&display=swap" rel="stylesheet">
</head>
<body>
<div id="content" class="content">
<h1 class="title">Curriculum Vitae | Anand Deopurkar</h1>
<div id="outline-container-orgbad855c" class="outline-2">
<h2 id="orgbad855c" class="collapsible">Positions</h2>
<div class="outline-text-2" id="text-orgbad855c">
<dl class="org-dl">
<dt>2021--</dt><dd>Senior lecturer<br />
Australian National University, Canberra, Australia.</dd>
<dt>2018&#x2013;2020</dt><dd>Lecturer<br />
Australian National University, Canberra, Australia.</dd>
<dt>2016&#x2013;2017</dt><dd>Assistant professor (limited term)<br />
University of Georgia, Athens, Georgia, USA.</dd>
<dt>2012&#x2013;2016</dt><dd>J. F. Ritt assistant professor<br />
Columbia University, New York City, New York, USA.</dd>
<dt>2008</dt><dd>Summer intern<br />
Microsoft Research, Bangalore, India.</dd>
</dl>
</div>
</div>
<div id="outline-container-org88e7cb7" class="outline-2">
<h2 id="org88e7cb7" class="collapsible">Education</h2>
<div class="outline-text-2" id="text-org88e7cb7">
<dl class="org-dl">
<dt>2012</dt><dd>Ph.D.<br />
Harvard University, Cambridge, Massachusetts, USA.<br />
      <i>Alternate compactifications of Hurwitz spaces</i>, advisor: Joseph Harris.</dd>
<dt>2008</dt><dd>Bachelor of Science (S.B.)<br />
Massachusetts Institute of Technology, Cambridge, Massachusetts, USA.<br />
      Mathematics with computer science.</dd>
</dl>
</div>
</div>
<div id="outline-container-org8297c6a" class="outline-2">
<h2 id="org8297c6a" class="collapsible">Grants and awards</h2>
<div class="outline-text-2" id="text-org8297c6a">
<dl class="org-dl">
<dt>2024</dt><dd>Discovery project award (DP), Australian Research Council (with Asilata Bapat, Anthony Licata).</dd>
<dt>2018</dt><dd>Discovery early career researcher award (DECRA), Australian Research Council.</dd>
<dt>2016</dt><dd>AMS-Simons travel grant, American Mathematical Society and Simons Foundation.</dd>
<dt>2016</dt><dd>Workshop funding, American Institute of Mathematics (with Maksym Fedorchuk, Ian Morrison, Xiaowei Wang).</dd>
<dt>2014</dt><dd>Award for excellence in teaching, Columbia University, Mathematics department.</dd>
<dt>2006</dt><dd>Jon A. Bucsela prize for the top undergraduate, Massachusetts Institute of Technology, Mathematics department.</dd>
<dt>2006</dt><dd>Rogers family prize for undergraduate summer research, Massachusetts Institute of Technology, Mathematics department.</dd>
<dt>2007, 2005, 2004</dt><dd>Honorable mention (2004) , honorable mention (2005), rank 16&#x2013;25 (2004), William Lowell Putnam competition.</dd>
</dl>
</div>
</div>
