docs/cv.tex
% Created 2025-06-11 Wed 09:52
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[margin=3cm]{geometry}
\hypersetup{hidelinks,colorlinks=false,urlcolor=black}
\usepackage{Baskervaldx}
\usepackage{marvosym}
\author{\href{mailto:anand.deopurkar@anu.edu.au}{\texttt{anand.deopurkar@anu.edu.au}} \(\quad\) \href{https://www.ananddeopurkar.org}{\texttt{ananddeopurkar.org}}}
\date{}
\title{Curriculum Vitae | Anand Deopurkar}
\hypersetup{
 pdfauthor={\href{mailto:anand.deopurkar@anu.edu.au}{\texttt{anand.deopurkar@anu.edu.au}} \(\quad\) \href{https://www.ananddeopurkar.org}{\texttt{ananddeopurkar.org}}},
 pdftitle={Curriculum Vitae | Anand Deopurkar},
 pdfkeywords={Curriculum vitae CV Anand Deopurkar},
 pdfsubject={Curriculum vitae of Anand Deopurkar},
 pdfcreator={Emacs 30.1 (Org mode 9.8-pre)},
 pdflang={English}}
\begin{document}

\maketitle
\section*{Positions}
\label{sec:org97914ac}
\phantomsection
\label{orgfb6dd06}
\begin{description}
\item[{2021--}] Senior lecturer\\
Australian National University, Canberra, Australia.
\item[{2018--2020}] Lecturer\\
Australian National University, Canberra, Australia.
\item[{2016--2017}] Assistant professor (limited term)\\
University of Georgia, Athens, Georgia, USA.
\item[{2012--2016}] J. F. Ritt assistant professor\\
Columbia University, New York City, New York, USA.
\item[{2008}] Summer intern\\
Microsoft Research, Bangalore, India.
\end{description}
\section*{Education}
\label{sec:org8cdce6a}
\phantomsection
\label{org057598f}
\begin{description}
\item[{2012}] Ph.D.\\
Harvard University, Cambridge, Massachusetts, USA.\\
      \emph{Alternate compactifications of Hurwitz spaces}, advisor: Joseph Harris.
\item[{2008}] Bachelor of Science (S.B.)\\
Massachusetts Institute of Technology, Cambridge, Massachusetts, USA.\\
      Mathematics with computer science.
\end{description}
\section*{Grants and awards}
\label{sec:org1ed2aed}
\phantomsection
\label{org941d9ca}
\begin{description}
\item[{2024}] Discovery project award (DP), Australian Research Council (with Asilata Bapat, Anthony Licata).
\item[{2018}] Discovery early career researcher award (DECRA), Australian Research Council.
\item[{2016}] AMS-Simons travel grant, American Mathematical Society and Simons Foundation.
\item[{---}] Workshop funding, American Institute of Mathematics (with Maksym Fedorchuk, Ian Morrison, Xiaowei Wang).
\item[{2014}] Award for excellence in teaching, Columbia University, Mathematics department.
\item[{2006}] Jon A. Bucsela prize for the top undergraduate, Massachusetts Institute of Technology, Mathematics department.
\item[{---}] Rogers family prize for undergraduate summer research, Massachusetts Institute of Technology, Mathematics department.
\item[{2007, 2005, 2004}] Honorable mention (2004) , honorable mention (2005), rank 16--25 (2004), William Lowell Putnam competition.
\end{description}
