docs/cv.html
<div id="outline-container-orgc03eaa5" class="outline-2">
<h2 id="orgc03eaa5" class="collapsible">Publications</h2>
<div class="outline-text-2" id="text-orgc03eaa5">
<dl class="org-dl">
<dt>2024</dt><dd><i>Orbits of linear series on the projective line</i>.<br />
International Mathematics Research Notices (with <a href="https://sites.google.com/view/anand-patel">Anand Patel</a>).</dd>
<dt>---</dt><dd><i>A universal formula for counting cubic surfaces</i>.<br />
Algebraic Geometry (to appear) (with <a href="https://sites.google.com/view/anand-patel">Anand Patel</a>, <a href="https://sites.google.com/view/dennis-tseng">Dennis Tseng</a>).</dd>
<dt>2022</dt><dd><i>Spherical objects and stability conditions on CY2 quiver categories</i>.<br />
Mathematische Zeitschrift (with <a href="https://asilata.org/">Asilata Bapat</a>, <a href="https://maths-people.anu.edu.au/~licatat/">Anthony Licata</a>).</dd>
<dt>---</dt><dd><i>Vector bundles and finite covers</i>.<br />
Forum of Mathematics, Sigma (with <a href="https://sites.google.com/view/anand-patel">Anand Patel</a>).</dd>
<dt>2021</dt><dd><i>Stable log surfaces, admissible covers, and canonical curves of genus 4</i>.<br />
Transactions of the Americal Mathematical Society (with Changho Han).</dd>
<dt>2020</dt><dd><i>Ramification divisors of general projections</i>.<br />
Documenta Mathematica (with <a href="https://eduryev.weebly.com/">Eduard Duryev</a>, <a href="https://sites.google.com/view/anand-patel">Anand Patel</a>).</dd>
<dt>2019</dt><dd><i>Covers of stacky curves and limits of plane quintics</i>.<br />
Transactions of the Americal Mathematical Society.</dd>
<dt>2018</dt><dd><i>Syzygy divisors on Hurwitz spaces</i>.<br />
Contemporary Mathematics (with <a href="https://sites.google.com/view/anand-patel">Anand Patel</a>).</dd>
<dt>---</dt><dd><i>The canonical syzygy conjecture for ribbons</i>.<br />
Mathematische Zeitschrift.</dd>
<dt>2016</dt><dd><i>Toward GIT stability of syzygies of canonical curves</i>.<br />
Algebraic Geometry (with <a href="https://www2.bc.edu/maksym-fedorchuk/">Maksym Fedorchuk</a>, <a href="http://faculty.fordham.edu/dswinarski/">David Swinarski</a>).</dd>
<dt>2015</dt><dd><i>The Picard rank conjecture for the Hurwitz spaces of degree up to five</i>.<br />
Algebra &amp; Number Theory (with <a href="https://www2.bc.edu/anand-p-patel/">Anand Patel</a>).</dd>
<dt>2014</dt><dd><i>Groebner techniques for ribbons</i>.<br />
Albanian Journal of Mathematics (with <a href="https://www2.bc.edu/maksym-fedorchuk/">Maksym Fedorchuk</a>, <a href="http://faculty.fordham.edu/dswinarski/">David Swinarski</a>).</dd>
<dt>---</dt><dd><i>Compactifications of Hurwitz spaces</i>.<br />
International Mathematics Research Notices.</dd>
<dt>2013</dt><dd><i>Sharp slope bounds for sweeping families of trigonal curves</i>.<br />
Mathematical Research Letters (with <a href="https://sites.google.com/view/anand-patel">Anand Patel</a>).</dd>
<dt>---</dt><dd><i>Modular compactifications of the space of marked trigonal curves</i>.<br />
Advances in Mathematics.</dd>
</dl>

<dl class="org-dl">
<dt>Pre-prints</dt><dd></dd>
</dl>
<dl class="org-dl">
<dt>2024</dt><dd><i>Compactifications of moduli spaces of K3 surfaces with a higher-order nonsymplectic automorphism</i>.<br />
Pre-print.</dd>
<dt>---</dt><dd><i>Syzygies of canonical ribbons on higher genus curves</i>.<br />
Pre-print.</dd>
<dt>---</dt><dd><i>Counting 3-uple Veronese surfaces</i>.<br />
Pre-print.</dd>
<dt>---</dt><dd><i>Equivariant classes of orbits in GL(2)-representations</i>.<br />
Pre-print.</dd>
<dt>2020</dt><dd><i>A Thurston compactification of the space of stability conditions</i>.<br />
Pre-print (with <a href="https://asilata.org/">Asilata Bapat</a>, <a href="https://maths-people.anu.edu.au/~licatat/">Anthony Licata</a>).</dd>
<dt>2019</dt><dd><i>Anticanonical tropical cubic del Pezzos contain exactly 27 lines</i>.<br />
Pre-print (with <a href="https://people.math.osu.edu/cueto.5/">María Angélica Cueto</a>).</dd>
<dt>2013</dt><dd><i>Class of the Hodge eigenbundle using orbifold Riemann-Roch</i>.<br />
Pre-print, appendix to <a href="https://drive.google.com/file/d/1wq-Fh3DiqODc51t-J0phIexVF7B4lxsY/view"><i>Cyclic covering morphisms on \(\overline M_{0,n}\)</i></a> by <a href="https://www2.bc.edu/maksym-fedorchuk/">Maksym Fedorchuk</a>.</dd>
</dl>

<dl class="org-dl">
<dt>Expository</dt><dd></dd>
</dl>
<dl class="org-dl">
<dt>2010</dt><dd><i>An introduction to intersection homology</i>.<br />
Minor thesis, Harvard, 2010 (expository).</dd>
<dt>2008</dt><dd><i>Normalization of algebraic varieties</i>.<br />
MIT Undergruate Journal of Mathematics (expository).</dd>
</dl>
</div>
</div>
