docs/cv.tex
\section*{Publications}
\label{sec:org012b481}
\phantomsection
\label{org45dc02f}
\begin{description}
\item[{2024}] \emph{\href{papers/erc.pdf}{Orbits of linear series on the projective line}}.\\
International Mathematics Research Notices (with \href{https://sites.google.com/view/anand-patel}{Anand Patel}).
\item[{---}] \emph{\href{papers/countingcubics.pdf}{A universal formula for counting cubic surfaces}}.\\
Algebraic Geometry (to appear) (with \href{https://sites.google.com/view/anand-patel}{Anand Patel}, \href{https://sites.google.com/view/dennis-tseng}{Dennis Tseng}).
\item[{2022}] \emph{\href{papers/2cy-algorithm.pdf}{Spherical objects and stability conditions on 2-Calabi--Yau quiver categories}}.\\
Mathematische Zeitschrift (with \href{https://asilata.org/}{Asilata Bapat}, \href{https://maths-people.anu.edu.au/\~licatat/}{Anthony Licata}).
\item[{---}] \emph{\href{papers/ebundle.pdf}{Vector bundles and finite covers}}.\\
Forum of Mathematics, Sigma (with \href{https://sites.google.com/view/anand-patel}{Anand Patel}).
\item[{2021}] \emph{\href{papers/TrigonalKSBA.pdf}{Stable log surfaces, admissible covers, and canonical curves of genus 4}}.\\
Transactions of the Americal Mathematical Society (with \href{https://sites.google.com/view/changho-han/}{Changho Han}).
\item[{2020}] \emph{\href{papers/PR.pdf}{Ramification divisors of general projections}}.\\
Documenta Mathematica (with \href{https://eduryev.weebly.com/}{Eduard Duryev}, \href{https://sites.google.com/view/anand-patel}{Anand Patel}).
\item[{2019}] \emph{\href{papers/StackyAdmissibleCovers.pdf}{Covers of stacky curves and limits of plane quintics}}.\\
Transactions of the Americal Mathematical Society.
\item[{2018}] \emph{\href{papers/HigherMaroni.pdf}{Syzygy divisors on Hurwitz spaces}}.\\
Contemporary Mathematics (with \href{https://sites.google.com/view/anand-patel}{Anand Patel}).
\item[{---}] \emph{\href{papers/RibbonGreen.pdf}{The canonical syzygy conjecture for ribbons}}.\\
Mathematische Zeitschrift.
\item[{2016}] \emph{\href{papers/gitsyzygy.pdf}{Toward GIT stability of syzygies of canonical curves}}.\\
Algebraic Geometry (with \href{https://www2.bc.edu/maksym-fedorchuk/}{Maksym Fedorchuk}, \href{http://faculty.fordham.edu/dswinarski/}{David Swinarski}).
\item[{2015}] \emph{\href{papers/PicH345.pdf}{The Picard rank conjecture for the Hurwitz spaces of degree up to five}}.\\
Algebra \& Number Theory (with \href{https://www2.bc.edu/anand-p-patel/}{Anand Patel}).
\item[{2014}] \emph{\href{papers/groebner.pdf}{Groebner techniques for ribbons}}.\\
Albanian Journal of Mathematics (with \href{https://www2.bc.edu/maksym-fedorchuk/}{Maksym Fedorchuk}, \href{http://faculty.fordham.edu/dswinarski/}{David Swinarski}).
\item[{---}] \emph{\href{papers/CompHurwitz.pdf}{Compactifications of Hurwitz spaces}}.\\
International Mathematics Research Notices.
\item[{2013}] \emph{\href{papers/TrigonalSlopes.pdf}{Sharp slope bounds for sweeping families of trigonal curves}}.\\
Mathematical Research Letters (with \href{https://sites.google.com/view/anand-patel}{Anand Patel}).
\item[{---}] \emph{\href{papers/MarkedTrigonal.pdf}{Modular compactifications of the space of marked trigonal curves}}.\\
Advances in Mathematics.
\end{description}

\begin{description}
\item[{Pre-prints}] 
\end{description}
\phantomsection
\label{org1003b9f}
\begin{description}
\item[{2025}] \emph{\href{papers/CompStabGenK3.pdf}{The Thurston compactification of the stability manifold of a generic analytic K3 surface}}.\\
Pre-print.
\item[{2024}] \emph{\href{papers/k3z3.pdf}{Compactifications of moduli spaces of K3 surfaces with a higher-order nonsymplectic automorphism}}.\\
Pre-print (with \href{https://www.math.uga.edu/directory/people/valery-alexeev}{Valery Alexeev}, \href{https://sites.google.com/view/changho-han/}{Changho Han}).
\item[{---}] \emph{\href{papers/highergenusribbons.pdf}{Syzygies of canonical ribbons on higher genus curves}}.\\
Pre-print (with \href{https://sites.google.com/view/mukherjeejayan}{Jayan Mukherjee}).
\item[{---}] \emph{\href{papers/3veroneseP2.pdf}{Counting 3-uple Veronese surfaces}}.\\
Pre-print (with \href{https://sites.google.com/view/anand-patel}{Anand Patel}).
\item[{---}] \emph{\href{papers/gl2orbits.pdf}{Equivariant classes of orbits in GL(2)-representations}}.\\
Pre-print.
\item[{2020}] \emph{\href{papers/a2-compactification.pdf}{A Thurston compactification of the space of stability conditions}}.\\
Pre-print (with \href{https://asilata.org/}{Asilata Bapat}, \href{https://maths-people.anu.edu.au/\~licatat/}{Anthony Licata}).
\item[{2019}] \emph{\href{papers/lines\_on\_tropical\_cubics.pdf}{Anticanonical tropical cubic del Pezzos contain exactly 27 lines}}.\\
Pre-print (with \href{https://people.math.osu.edu/cueto.5/}{María Angélica Cueto}).
\item[{2013}] \emph{\href{papers/CyclicAppendix.pdf}{Class of the Hodge eigenbundle using orbifold Riemann-Roch}}.\\
Pre-print, appendix to \href{https://drive.google.com/file/d/1wq-Fh3DiqODc51t-J0phIexVF7B4lxsY/view}{\emph{Cyclic covering morphisms on \(\overline M_{0,n}\)}} by \href{https://www2.bc.edu/maksym-fedorchuk/}{Maksym Fedorchuk}.
\end{description}

\begin{description}
\item[{Expository}] 
\end{description}
\phantomsection
\label{org6c40f1d}
\begin{description}
\item[{2025}] \emph{\href{papers/arithmetic\_covers.pdf}{The arithmetic and geometry of branched coverings: theorems of Belyi and Darmon--Granville}}.\\
Pre-print.
\item[{2010}] \emph{\href{papers/anandrd\_minor\_thesis.pdf}{An introduction to intersection homology}}.\\
Minor thesis, Harvard, 2010.
\item[{2008}] \emph{\href{papers/anandrd\_ug\_thesis.pdf}{Normalization of algebraic varieties}}.\\
MIT Undergruate Journal of Mathematics.
\end{description}
