content/cv.org
* Supervision
:PROPERTIES:
:html_headline_class: collapsible
:END:
#+begin_src elisp :exports results :results value raw drawer :lexical t
  ;; Our pretty-printing function
  (let ((previous ""))
    (defun pretty-print ()
      (let ((name (org-entry-get nil "ITEM"))
            (year (org-entry-get nil "year"))
            (level (org-entry-get nil "level"))
            (coadvisors (org-entry-get nil "with"))
            (comment (org-entry-get nil "comment")))
        (format "- %s :: %s, %s%s%s."
                (if (equal previous year)
                    "---"
                  (setq previous year))
                name
                level
                (if coadvisors
                    (concat " (with " coadvisors ")")
                  "")
                (if comment
                    (format " (%s)" comment)
                  "")
                ))))
  (string-join (org-map-entries 'pretty-print nil '("#supervision.org")) "\n")
#+end_src

#+RESULTS:
:results:
- 2024 :: Luke Doherty, Honours.
- --- :: Charlotte Sherratt, Honours.
- 2023 :: Benedict Bawagan, Honours.
- --- :: Leyao Zha, Honours.
- --- :: Charles McIntosh, Honours.
- --- :: Alex Huang, Summer Research Scholar (with Noah White).
- --- :: Charlotte Sherratt, Summer Research Scholar (with Noah White).
- --- :: Thomas Whitley, Summer Research Scholar (with Noah White).
- --- :: Jia En Toh, Summer Research Scholar (with Noah White).
- 2022 :: Oliver Bradley, Honours.
- 2021 :: Zongpu Zhang, Honours.
- 2020 :: Ben Leedom, Honours.
- 2019 :: Diclehan Erdal, Masters.
- --- :: Adwait Sengar, Masters (with Uri Onn).
- --- :: Dhruva Kelkar, Future Research Scholar.
- --- :: Sridhar Venkatesh, Future Research Scholar.
- 2018 :: Sean Carroll, Summer Research Scholar (with Asilata Bapat).
- --- :: Kyle Broder, Honours (with Alex Isaev).
- --- :: Likun Yao, Honours (with Amnon Neeman).
:end:

