docs/cv.html
<div id="outline-container-org19011c4" class="outline-2">
<h2 id="org19011c4" class="collapsible">Supervision</h2>
<div class="outline-text-2" id="text-org19011c4">
<dl class="org-dl">
<dt>2024</dt><dd>Luke Doherty, Honours.</dd>
<dt>---</dt><dd>Charlotte Sherratt, Honours.</dd>
<dt>2023</dt><dd>Benedict Bawagan, Honours.</dd>
<dt>---</dt><dd>Leyao Zha, Honours.</dd>
<dt>---</dt><dd>Charles McIntosh, Honours.</dd>
<dt>---</dt><dd>Alex Huang, Summer Research Scholar (with Noah White).</dd>
<dt>---</dt><dd>Charlotte Sherratt, Summer Research Scholar (with Noah White).</dd>
<dt>---</dt><dd>Thomas Whitley, Summer Research Scholar (with Noah White).</dd>
<dt>---</dt><dd>Jia En Toh, Summer Research Scholar (with Noah White).</dd>
<dt>2022</dt><dd>Oliver Bradley, Honours.</dd>
<dt>2021</dt><dd>Zongpu Zhang, Honours.</dd>
<dt>2020</dt><dd>Ben Leedom, Honours.</dd>
<dt>2019</dt><dd>Diclehan Erdal, Masters.</dd>
<dt>---</dt><dd>Adwait Sengar, Masters (with Uri Onn).</dd>
<dt>---</dt><dd>Dhruva Kelkar, Future Research Scholar.</dd>
<dt>---</dt><dd>Sridhar Venkatesh, Future Research Scholar.</dd>
<dt>2018</dt><dd>Sean Carroll, Summer Research Scholar (with Asilata Bapat).</dd>
<dt>---</dt><dd>Kyle Broder, Honours (with Alex Isaev).</dd>
<dt>---</dt><dd>Likun Yao, Honours (with Amnon Neeman).</dd>
</dl>
</div>
</div>
