docs/cv.tex
\section*{Supervision}
\label{sec:org25100bb}
\phantomsection
\label{org81a3926}
\begin{description}
\item[{2024}] Luke Doherty, Honours.
\item[{---}] Charlotte Sherratt, Honours.
\item[{2023}] Benedict Bawagan, Honours.
\item[{---}] Leyao Zha, Honours.
\item[{---}] Charles McIntosh, Honours.
\item[{---}] Alex Huang, Summer Research Scholar (with Noah White).
\item[{---}] Charlotte Sherratt, Summer Research Scholar (with Noah White).
\item[{---}] Thomas Whitley, Summer Research Scholar (with Noah White).
\item[{---}] Jia En Toh, Summer Research Scholar (with Noah White).
\item[{2022}] Oliver Bradley, Honours.
\item[{2021}] Zongpu Zhang, Honours.
\item[{2020}] Ben Leedom, Honours.
\item[{2019}] Diclehan Erdal, Masters.
\item[{---}] Adwait Sengar, Masters (with Uri Onn).
\item[{---}] Dhruva Kelkar, Future Research Scholar.
\item[{---}] Sridhar Venkatesh, Future Research Scholar.
\item[{2018}] Sean Carroll, Summer Research Scholar (with Asilata Bapat).
\item[{---}] Kyle Broder, Honours (with Alex Isaev).
\item[{---}] Likun Yao, Honours (with Amnon Neeman).
\end{description}
