docs/cv.html
<div id="outline-container-org5ad42b0" class="outline-2">
<h2 id="org5ad42b0" class="collapsible">Talks and presentations</h2>
<div class="outline-text-2" id="text-org5ad42b0">
<dl class="org-dl">
<dt>2025</dt><dd><i>A Thurston compactification of the space of stability conditions</i>. Teichmuller theory and flat structures, MATRIX, Creswick, Australia.</dd>
<dt>---</dt><dd><i>The enumerative geometry of orbit closures</i>. Pure mathematics seminar, University of Melbourne, Melbourne, Australia.</dd>
<dt>2024</dt><dd><i>How twisty is that orbit?</i>. Computations and applications of commutative algebra and algebraic geometry, NZMS-AustMS-AMS, Auckland, New Zealand.</dd>
<dt>---</dt><dd><i>The work of Maryam Mirzakhani</i>. Women in maths day, Australian National University, Canberra, Australian.</dd>
<dt>---</dt><dd><i>Papercraft</i>. ANU Mathematics Extension Program, Canberra, Australia (expository).</dd>
<dt>---</dt><dd><i>The geometry of stability conditions</i>. Artin groups meet triangulated categories, Mathematisches Forschungsinstitut Oberwolfach, Oberwolfach, Germany.</dd>
<dt>---</dt><dd><i>How to count using equivariant cohomology</i>. Workshop on computational and applied algebraic geometry, Isaac Newton Institute, Cambridge, UK.</dd>
<dt>---</dt><dd><i>How to count using equivariant cohomology</i>. Imperial College, London, UK.</dd>
<dt>---</dt><dd><i>Stability conditions, metrics, and compactifications</i>. School of Mathematics, Edinburgh, UK.</dd>
<dt>2023</dt><dd><i>Stability conditions, metrics, and compactifications (lecture series)</i>. Summer school 2023 on algebraic geometry: derived categories, stability conditions, and moduli, Technion, Haifa, Israel.</dd>
<dt>---</dt><dd><i>Braids, automata, and the PL-sphere</i>. Braids: algebra and geometry, Australian National University, Canberra, Australia.</dd>
<dt>2022</dt><dd><i>Carpentry, geometry, and category theory</i>. Chennai Mathematical Institute, Chennai, India.</dd>
<dt>---</dt><dd><i>Error correcting codes</i>. ANU Mathematics Extension Program, Canberra, Australia (expository).</dd>
<dt>---</dt><dd><i>How to count using equivariant cohomology</i>. Australian National University, Canberra, Australia.</dd>
<dt>---</dt><dd><i>Combinatorics and dynamics of Harder-Narasimhan filtrations</i>. Tsinghua University (Online), Beijing, China.</dd>
<dt>---</dt><dd><i>Braids and monodromy in algebraic geometry</i>. Braids in Symplectic and Algebraic Geometry, ICERM, Brown University, Providence, Rhode Island (preparatory talk for the conference).</dd>
<dt>---</dt><dd><i>How to count using equivariant cohomology</i>. Harvard University, Cambridge, Massachusetts.</dd>
<dt>---</dt><dd><i>Apparent boundaries of projective varieties</i>. Brown University, Providence, Rhode Island.</dd>
<dt>---</dt><dd><i>The geometry and combinatorics of Harder&#x2013;Narasimhan filtrations</i>. Braids in representation theory and algebraic combinatorics, Institute for Computational and Experimental Research in Mathematics, Providence, Rhode Island.</dd>
<dt>---</dt><dd><i>The geometry of Fermat-like equations</i>. Trimester program on triangle groups, Belyi uniformization, and modularity, Bhaskaracharya Pratishthana, Pune, India (expository).</dd>
<dt>2021</dt><dd><i>Algebraic curves and Belyi&rsquo;s theorem</i>. Trimester program on triangle groups, Belyi uniformization, and modularity, Bhaskaracharya Pratishthana, Pune, India (expository).</dd>
<dt>---</dt><dd><i>Error correcting codes</i>. ANU Mathematics Extension Program, Canberra, Australia (expository).</dd>
<dt>---</dt><dd><i>A Thurston compactification of the space of stability conditions</i>. Workshop on compactifications of stability manifolds (Online), Max Planck institute für Mathematics, Bonn, Germany.</dd>
<dt>---</dt><dd><i>A Thurston compactification of the space of stability conditions</i>. Tata Institute of Fundamental Research (Online), Mumbai, India.</dd>
<dt>---</dt><dd><i>A Thurston compactification of the space of stability conditions</i>. Jagiellonian University (Online), Kraków, Poland.</dd>
<dt>2020</dt><dd><i>A Thurston compactification for categories</i>. Topology session, AustMS (Online), University of New England, Amidale, Australia.</dd>
<dt>---</dt><dd><i>Apparent boundaries of projective varieties</i>. Seminario nacional de geometria algebraica (Online joint seminar of multiple universities in Mexico), Mexico.</dd>
<dt>---</dt><dd><i>Apparent boundaries of projective varieties</i>. University of California (Online), San Diego, California.</dd>
<dt>2019</dt><dd><i>Groups, spherical twists, and stability conditions</i>. Workshop on triangulated categories in geometry and representation theory, University of Sydney, Sydney, Australia (part of a series with Asilata Bapat and Anthony Licata).</dd>
<dt>---</dt><dd><i>Log surfaces of almost K3 type and curves of genus 4</i>. Birational geometry and moduli spaces, University of Sydney, Sydney, Australia.</dd>
<dt>---</dt><dd><i>The work of Claire Voisin</i>. Women in mathematics day, Australian National University, Canberra, Australia (expository).</dd>
<dt>2018</dt><dd><i>Geometry of Hurwitz spaces</i>. Character varieties and topological quantum field theory, University of Auckland, Auckland, New Zealand.</dd>
<dt>---</dt><dd><i>On the geometric Steinitz problem</i>. University of South Australia, Adelaide, Australia.</dd>
<dt>---</dt><dd><i>The work of Caucher Birkar</i>. Colloquium, Australian National University, Canberra, Australia (expository).</dd>
<dt>---</dt><dd><i>Moduli of almost K3 log surfaces and curves of genus 4</i>. Algebraic surfaces and related topics, Xiamen University, Xiamen, China.</dd>
<dt>---</dt><dd><i>How to count using (co)homology</i>. Tata Institute of Fundamental Research, Mumbai, India (expository).</dd>
<dt>---</dt><dd><i>What are ribbons and what do they tell us about Riemann surfaces</i>. Indian Institute of Science, Bengaluru, India.</dd>
<dt>---</dt><dd><i>What are ribbons and what do they tell us about Riemann surfaces</i>. Monash University, Melbourne, Australia.</dd>
<dt>---</dt><dd><i>On the critical loci of finite maps</i>. Australian National University, Canberra, Australia.</dd>
<dt>---</dt><dd><i>Quadrature and algebraic geometry</i>. Workshop on algebraic geometry approximation, and optimization, MATRIX, Creswick, Victoria, Australia.</dd>
<dt>2017</dt><dd><i>Vector bundles and finite covers</i>. Workshop on topics in algebraic geometry, University of North Carolina, Chapel Hill, North Carolina.</dd>
<dt>---</dt><dd><i>Vector bundles and finite covers</i>. University of Georgia, Athens, Georgia.</dd>
<dt>---</dt><dd><i>How to count using topology</i>. Canada/USA Mathcamp, Tacoma, WA (expository).</dd>
<dt>---</dt><dd><i>Quivers and their representations</i>. Indian Institute of Science Education and Research, Pune, India.</dd>
<dt>---</dt><dd><i>Vector bundles and finite covers</i>. Emory University, Atlanta, Georgia.</dd>
<dt>2016</dt><dd><i>Geometry of moduli spaces</i>. Australian National University, Canberra, Australia.</dd>
<dt>---</dt><dd><i>Vector bundles and finite covers</i>. Conference on moduli and birational geometry, Jeju Island, South Korea.</dd>
<dt>---</dt><dd><i>Vector bundles and finite covers</i>. Indian Institute of Science Education and Research, Pune.</dd>
<dt>---</dt><dd><i>Ribbons and Green&rsquo;s conjecture</i>. University of South Carolina, Columbia, South Carolina.</dd>
<dt>---</dt><dd><i>Ribbons and Green&rsquo;s conjecture</i>. University of Georgia, Athens, Georgia.</dd>
<dt>---</dt><dd><i>Cycles on Hurwitz spaces</i>. Workshop on cycles on moduli spaces, geometric invariant theory, and dynamics, Institute for Computational and Experimental Research in Mathematics, Providence, Rhode Island.</dd>
<dt>---</dt><dd><i>The algebra of canonical curves and the geometry of their moduli space</i>. University of Georgia, Athens, Georgia.</dd>
<dt>---</dt><dd><i>Picard groups of Hurwitz spaces</i>. Higher genus curves and fibrations of higher genus curves in mathematical physics and arithmetic geometry II, AMS joint mathematics meetings, Seattle, Washington.</dd>
<dt>---</dt><dd><i>Limits of plane quintics via covers of stacky curves</i>. Moduli spaces in algebraic geometry I, AMS joint mathematics meetings, Seattle, Washington.</dd>
<dt>2015</dt><dd><i>Limits of plane quintics via covers of stacky curves</i>. Boston College&#x2013;Northeastern algebraic geometry conference, Northeastern University, Boston, Massachusetts.</dd>
<dt>---</dt><dd><i>Limits of plane quintics via covers of stacky curves</i>. Summer institute in algebraic geometry, University of Utah, Salt Lake City, Utah (poster).</dd>
<dt>---</dt><dd><i>Syzygies of canonical curves and the geometry of \(\overline M_g\)</i>. SIAM applied algebraic geometry conference, Daejeon, South Korea.</dd>
<dt>---</dt><dd><i>GIT stability of syzygies of curves</i>. Mathematisches Forschungsinstitut Oberwolfach, Oberwolfach, Germany (mini talk).</dd>
<dt>---</dt><dd><i>Syzygies, GIT, and the moduli space of curves</i>. Purdue University, West Lafayette, Indiana.</dd>
<dt>---</dt><dd><i>Limits of plane curves via stacky branched covers</i>. Ohio State University, Columbus, Ohio.</dd>
<dt>---</dt><dd><i>Syzygies, GIT, and the log minimal model program for \(\overline{M}_g\)</i>. Harvard University, Cambridge, Massachusetts.</dd>
<dt>---</dt><dd><i>Picard groups of Hurwitz spaces</i>. Courant Institute, New York University, New York City, New York.</dd>
<dt>---</dt><dd><i>The birational geometry of \(\overline M_g\)</i>. Indian Institute for Science Research and Education, Pune, India.</dd>
<dt>---</dt><dd><i>Syzygies of canonical curves and birational geometry of \(\overline M_g\)</i>. Stony Brook University, Stony Brook, New York.</dd>
<dt>2014</dt><dd><i>GIT stability of syzygies of canonical curves</i>. University of Michigan, Ann Arbor, Michigan.</dd>
<dt>---</dt><dd><i>GIT stability of syzygies of canonical curves</i>. Yale University, New Haven, Connecticut.</dd>
<dt>---</dt><dd><i>Towards GIT stability of syzygies of canonical curves</i>. Boston College, Boston, Massachusetts.</dd>
<dt>2013</dt><dd><i>Towards GIT stability of syzygies of canonical curves</i>. Postech, Pohang, Korea.</dd>
<dt>---</dt><dd><i>Towards GIT stability of syzygies of canonical curves</i>. Geometry of algebraic varieties, AMS sectional meeting, Philadelphia, Pennsylvania.</dd>
<dt>---</dt><dd><i>Sharp slope bounds for sweeping families of trigonal curves</i>. Algebraic geometry northeastern series, Boston College, Boston, Massachusetts (poster).</dd>
<dt>---</dt><dd><i>Alternate compactifications of Hurwitz spaces</i>. Stanford University, Palo Alto, California.</dd>
<dt>---</dt><dd><i>Compactifying spaces of branched covers</i>. Princeton University, Princeton, New Jersey.</dd>
<dt>2012</dt><dd><i>Alternate compactifications of Hurwitz spaces</i>. Rice University, Houston, Texas.</dd>
<dt>2011</dt><dd><i>Compactifications of Hurwitz spaces</i>. Massachusetts Institute of Technology, Cambridge, Massachusetts.</dd>
<dt>---</dt><dd><i>Compactifications of Hurwitz spaces</i>. Columbia University, New York City, New York.</dd>
<dt>---</dt><dd><i>Compactifications of Hurwitz spaces</i>. Stony Brook University, Stony Brook, New York.</dd>
<dt>---</dt><dd><i>Compactifications of Hurwitz spaces</i>. Brown University, Providence, Rhode Island.</dd>
<dt>---</dt><dd><i>Birational geometry of the space of marked trigonal curves</i>. A celebration of algebraic geometry (conference for the 60th birthday of Joe Harris), Harvard University, Cambridge, Massachusetts (poster).</dd>
</dl>
</div>
</div>
