docs/cv.tex
\section*{Talks and presentations}
\label{sec:org92eaf05}
\phantomsection
\label{orga84678c}
\begin{description}
\item[{2025}] \emph{A Thurston compactification of the space of stability conditions}. Teichmuller theory and flat structures, MATRIX, Creswick, Australia.
\item[{---}] \emph{The enumerative geometry of orbit closures}. Pure mathematics seminar, University of Melbourne, Melbourne, Australia.
\item[{2024}] \emph{How twisty is that orbit?}. Computations and applications of commutative algebra and algebraic geometry, NZMS-AustMS-AMS, Auckland, New Zealand.
\item[{---}] \emph{The work of Maryam Mirzakhani}. Women in maths day, Australian National University, Canberra, Australian.
\item[{---}] \emph{Papercraft}. ANU Mathematics Extension Program, Canberra, Australia (expository).
\item[{---}] \emph{The geometry of stability conditions}. Artin groups meet triangulated categories, Mathematisches Forschungsinstitut Oberwolfach, Oberwolfach, Germany.
\item[{---}] \emph{How to count using equivariant cohomology}. Workshop on computational and applied algebraic geometry, Isaac Newton Institute, Cambridge, UK.
\item[{---}] \emph{How to count using equivariant cohomology}. Imperial College, London, UK.
\item[{---}] \emph{Stability conditions, metrics, and compactifications}. School of Mathematics, Edinburgh, UK.
\item[{2023}] \emph{Stability conditions, metrics, and compactifications (lecture series)}. Summer school 2023 on algebraic geometry: derived categories, stability conditions, and moduli, Technion, Haifa, Israel.
\item[{---}] \emph{Braids, automata, and the PL-sphere}. Braids: algebra and geometry, Australian National University, Canberra, Australia.
\item[{2022}] \emph{Carpentry, geometry, and category theory}. Chennai Mathematical Institute, Chennai, India.
\item[{---}] \emph{Error correcting codes}. ANU Mathematics Extension Program, Canberra, Australia (expository).
\item[{---}] \emph{How to count using equivariant cohomology}. Australian National University, Canberra, Australia.
\item[{---}] \emph{Combinatorics and dynamics of Harder-Narasimhan filtrations}. Tsinghua University (Online), Beijing, China.
\item[{---}] \emph{Braids and monodromy in algebraic geometry}. Braids in Symplectic and Algebraic Geometry, ICERM, Brown University, Providence, Rhode Island (preparatory talk for the conference).
\item[{---}] \emph{\href{talks/Harvard2022.pdf}{How to count using equivariant cohomology}}. Harvard University, Cambridge, Massachusetts.
\item[{---}] \emph{Apparent boundaries of projective varieties}. Brown University, Providence, Rhode Island.
\item[{---}] \emph{\href{talks/ICERM2022.pdf}{The geometry and combinatorics of Harder--Narasimhan filtrations}}. Braids in representation theory and algebraic combinatorics, Institute for Computational and Experimental Research in Mathematics, Providence, Rhode Island.
\item[{---}] \emph{\href{talks/Fermat2022.pdf}{The geometry of Fermat-like equations}}. Trimester program on triangle groups, Belyi uniformization, and modularity, Bhaskaracharya Pratishthana, Pune, India (expository).
\item[{2021}] \emph{\href{talks/Belyi2021.pdf}{Algebraic curves and Belyi's theorem}}. Trimester program on triangle groups, Belyi uniformization, and modularity, Bhaskaracharya Pratishthana, Pune, India (expository).
\item[{---}] \emph{\href{talks/ecc2021/ecc.html}{Error correcting codes}}. ANU Mathematics Extension Program, Canberra, Australia (expository).
\item[{---}] \emph{\href{talks/Bonn2021.pdf}{A Thurston compactification of the space of stability conditions}}. Workshop on compactifications of stability manifolds (Online), Max Planck institute für Mathematics, Bonn, Germany.
\item[{---}] \emph{\href{talks/tifr2021.pdf}{A Thurston compactification of the space of stability conditions}}. Tata Institute of Fundamental Research (Online), Mumbai, India.
\item[{---}] \emph{A Thurston compactification of the space of stability conditions}. Jagiellonian University (Online), Kraków, Poland.
\item[{2020}] \emph{\href{talks/AustMS2020.pdf}{A Thurston compactification for categories}}. Topology session, AustMS (Online), University of New England, Amidale, Australia.
\item[{---}] \emph{\href{talks/PR2020-Oaxaca.pdf}{Apparent boundaries of projective varieties}}. Seminario nacional de geometria algebraica (Online joint seminar of multiple universities in Mexico), Mexico.
\item[{---}] \emph{\href{talks/PR2020-UCSD.pdf}{Apparent boundaries of projective varieties}}. University of California (Online), San Diego, California.
\item[{2019}] \emph{\href{talks/StabSydney2019.pdf}{Groups, spherical twists, and stability conditions}}. Workshop on triangulated categories in geometry and representation theory, University of Sydney, Sydney, Australia (part of a series with Asilata Bapat and Anthony Licata).
\item[{---}] \emph{\href{talks/K3Sydney2019.pdf}{Log surfaces of almost K3 type and curves of genus 4}}. Birational geometry and moduli spaces, University of Sydney, Sydney, Australia.
\item[{---}] \emph{\href{talks/WIM2019.pdf}{The work of Claire Voisin}}. Women in mathematics day, Australian National University, Canberra, Australia (expository).
\item[{2018}] \emph{\href{talks/NZ2018.pdf}{Geometry of Hurwitz spaces}}. Character varieties and topological quantum field theory, University of Auckland, Auckland, New Zealand.
\item[{---}] \emph{\href{talks/AustMS2018.pdf}{On the geometric Steinitz problem}}. University of South Australia, Adelaide, Australia.
\item[{---}] \emph{\href{talks/FMColloquium2018.pdf}{The work of Caucher Birkar}}. Colloquium, Australian National University, Canberra, Australia (expository).
\item[{---}] \emph{Moduli of almost K3 log surfaces and curves of genus 4}. Algebraic surfaces and related topics, Xiamen University, Xiamen, China.
\item[{---}] \emph{\href{talks/tifr2018.pdf}{How to count using (co)homology}}. Tata Institute of Fundamental Research, Mumbai, India (expository).
\item[{---}] \emph{What are ribbons and what do they tell us about Riemann surfaces}. Indian Institute of Science, Bengaluru, India.
\item[{---}] \emph{\href{talks/Monash2018.pdf}{What are ribbons and what do they tell us about Riemann surfaces}}. Monash University, Melbourne, Australia.
\item[{---}] \emph{On the critical loci of finite maps}. Australian National University, Canberra, Australia.
\item[{---}] \emph{\href{talks/MATRIX2018.pdf}{Quadrature and algebraic geometry}}. Workshop on algebraic geometry approximation, and optimization, MATRIX, Creswick, Victoria, Australia.
\item[{2017}] \emph{Vector bundles and finite covers}. Workshop on topics in algebraic geometry, University of North Carolina, Chapel Hill, North Carolina.
\item[{---}] \emph{Vector bundles and finite covers}. University of Georgia, Athens, Georgia.
\item[{---}] \emph{How to count using topology}. Canada/USA Mathcamp, Tacoma, WA (expository).
\item[{---}] \emph{Quivers and their representations}. Indian Institute of Science Education and Research, Pune, India.
\item[{---}] \emph{Vector bundles and finite covers}. Emory University, Atlanta, Georgia.
\item[{2016}] \emph{Geometry of moduli spaces}. Australian National University, Canberra, Australia.
\item[{---}] \emph{\href{talks/Jeju2016.pdf}{Vector bundles and finite covers}}. Conference on moduli and birational geometry, Jeju Island, South Korea.
\item[{---}] \emph{Vector bundles and finite covers}. Indian Institute of Science Education and Research, Pune.
\item[{---}] \emph{Ribbons and Green's conjecture}. University of South Carolina, Columbia, South Carolina.
\item[{---}] \emph{Ribbons and Green's conjecture}. University of Georgia, Athens, Georgia.
\item[{---}] \emph{Cycles on Hurwitz spaces}. Workshop on cycles on moduli spaces, geometric invariant theory, and dynamics, Institute for Computational and Experimental Research in Mathematics, Providence, Rhode Island.
\item[{---}] \emph{The algebra of canonical curves and the geometry of their moduli space}. University of Georgia, Athens, Georgia.
\item[{---}] \emph{Picard groups of Hurwitz spaces}. Higher genus curves and fibrations of higher genus curves in mathematical physics and arithmetic geometry II, AMS joint mathematics meetings, Seattle, Washington.
\item[{---}] \emph{Limits of plane quintics via covers of stacky curves}. Moduli spaces in algebraic geometry I, AMS joint mathematics meetings, Seattle, Washington.
\item[{2015}] \emph{\href{talks/AGNUBS2015.pdf}{Limits of plane quintics via covers of stacky curves}}. Boston College--Northeastern algebraic geometry conference, Northeastern University, Boston, Massachusetts.
\item[{---}] \emph{\href{talks/quintics\_poster.pdf}{Limits of plane quintics via covers of stacky curves}}. Summer institute in algebraic geometry, University of Utah, Salt Lake City, Utah (poster).
\item[{---}] \emph{\href{talks/SIAM2015.pdf}{Syzygies of canonical curves and the geometry of \(\overline M_g\)}}. SIAM applied algebraic geometry conference, Daejeon, South Korea.
\item[{---}] \emph{GIT stability of syzygies of curves}. Mathematisches Forschungsinstitut Oberwolfach, Oberwolfach, Germany (mini talk).
\item[{---}] \emph{Syzygies, GIT, and the moduli space of curves}. Purdue University, West Lafayette, Indiana.
\item[{---}] \emph{Limits of plane curves via stacky branched covers}. Ohio State University, Columbus, Ohio.
\item[{---}] \emph{Syzygies, GIT, and the log minimal model program for \(\overline{M}_g\)}. Harvard University, Cambridge, Massachusetts.
\item[{---}] \emph{Picard groups of Hurwitz spaces}. Courant Institute, New York University, New York City, New York.
\item[{---}] \emph{The birational geometry of \(\overline M_g\)}. Indian Institute for Science Research and Education, Pune, India.
\item[{---}] \emph{Syzygies of canonical curves and birational geometry of \(\overline M_g\)}. Stony Brook University, Stony Brook, New York.
\item[{2014}] \emph{GIT stability of syzygies of canonical curves}. University of Michigan, Ann Arbor, Michigan.
\item[{---}] \emph{GIT stability of syzygies of canonical curves}. Yale University, New Haven, Connecticut.
\item[{---}] \emph{Towards GIT stability of syzygies of canonical curves}. Boston College, Boston, Massachusetts.
\item[{2013}] \emph{\href{talks/syz2013.pdf}{Towards GIT stability of syzygies of canonical curves}}. Postech, Pohang, Korea.
\item[{---}] \emph{Towards GIT stability of syzygies of canonical curves}. Geometry of algebraic varieties, AMS sectional meeting, Philadelphia, Pennsylvania.
\item[{---}] \emph{\href{talks/slopes\_poster.pdf}{Sharp slope bounds for sweeping families of trigonal curves}}. Algebraic geometry northeastern series, Boston College, Boston, Massachusetts (poster).
\item[{---}] \emph{\href{talks/Hdg2013.pdf}{Alternate compactifications of Hurwitz spaces}}. Stanford University, Palo Alto, California.
\item[{---}] \emph{Compactifying spaces of branched covers}. Princeton University, Princeton, New Jersey.
\item[{2012}] \emph{Alternate compactifications of Hurwitz spaces}. Rice University, Houston, Texas.
\item[{2011}] \emph{\href{talks/Hdg2013.pdf}{Compactifications of Hurwitz spaces}}. Massachusetts Institute of Technology, Cambridge, Massachusetts.
\item[{---}] \emph{Compactifications of Hurwitz spaces}. Columbia University, New York City, New York.
\item[{---}] \emph{Compactifications of Hurwitz spaces}. Stony Brook University, Stony Brook, New York.
\item[{---}] \emph{Compactifications of Hurwitz spaces}. Brown University, Providence, Rhode Island.
\item[{---}] \emph{\href{talks/trig\_poster.pdf}{Birational geometry of the space of marked trigonal curves}}. A celebration of algebraic geometry (conference for the 60th birthday of Joe Harris), Harvard University, Cambridge, Massachusetts (poster).
\end{description}
