content/cv.org
* Service
:PROPERTIES:
:html_headline_class: collapsible
:END:
#+begin_src elisp :exports results :results value raw drawer :lexical t
  ;; Our pretty-printing function
  (let ((previous ""))
    (defun pretty-print ()
      (let ((title (org-entry-get nil "ITEM"))
            (year (org-entry-get nil "year"))
            (with (org-entry-get nil "with"))
            (institute (org-entry-get nil "institute")))
        (format "- %s :: %s%s%s."
                (if year
                    (if (equal previous year)
                        "---"
                      (setq previous year))
                  "*")
                title
                (if with
                    (format " %s" with)
                  "")
                (if institute
                    (format ", %s" institute)
                  "")
                ))))
  (string-join (org-map-entries 'pretty-print nil '("#service.org")) "\n")
#+end_src

#+RESULTS:
:results:
- * :: Refereed for Journal of the European Mathematical Society, Journal of Differential Geometry, Journal of Algebraic Geometry, Annales Scientifiques de l'École Normale Supérieure, Mathematische Annalen, Algebra and Number Theory, Journal für die reine und angewandte Mathematik, manuscripta mathematica, Advances in Geometry, Mathematical Research Letters, European Journal of Mathematics, Journal de l'École polytechnique — Mathématiques, Experimental mathematics.
- * :: Reviewed for Mathematical Reviews, American Mathematical Society.
- 2021-- :: Convener for the Masters program, Mathematical Sciences Institute, Australian National University.
- * :: Headed the selection committee for the /Future research talent fellowship/.
- * :: Served on the thesis committee of Kabeer Manali Rahul.
- 2024 :: Co-organised the session /Computations and applications of commutative algebra and algebraic geometry/ at the joint /NZMS-AustMS-AMS/ meeting John Cobb, Sione Ma'u, and Hal Schenk, University of Auckland.
- 2022 :: Co-organised the workshop /Braids in Symplectic and Algebraic Geometry/ Inanc Baykur, Benson Farb, Anthony Licata, and Ailsa Keating, Institute for Computational and Experimental Research in Mathematics (ICERM), Brown University.
- 2021 :: Served on the award committee for the /BH Neumann prize/ for the best student talk, AustMS meeting.
- 2020 :: Served on the thesis committee of Abhishek Bharadwaj, Mathematical Sciences Institute, Australian National University.
- 2019 :: Served on the selection committee for the /Future research talent fellowship/, Mathematical Sciences Institute, Australian National University.
- --- :: Served on the director search committee, Mathematical Sciences Institute, Australian National University.
- --- :: Served on the formal liaison committee, Mathematical Sciences Institute, Australian National University.
- 2018 :: Served on the award committee for the /BH Neumann prize/ for the best student talk, AustMS meeting.
- --- :: Co-organised the workshop /Polynomial Algebraic Developments in Optimisation and Computation/ Markus Hegland.
- --- :: Conducted training sessions in algebraic geometry at the /D21 Workshop/, Australian Signals Directorate.
- 2017 :: Co-organised the workshop /Stability and moduli spaces/ Maksym Fedorchuk, Ian Morrison, Xiaowei Wang, American Institute of Matheatics, Palo Alto, California.
- 2016 :: Co-organised the /Summer workshop in algebraic geometry/ Angela Gibney, Nicola Tarasca, University of Georgia, Athens, Georgia.
- --- :: Organised the /Fairly informal reading seminar and tea (FIRST)/, University of Georgia, Athens, Georgia.
- --- :: Co-organised the graduate student algebraic geometry seminar Johan de Jong, Columbia University.
- 2015 :: Conducted preparation sessions for the Putnam competition, Columbia University.
- 2014 :: Lectured in the /Workshop on birational geometry and stability of moduli stacks and spaces of curves/, Vietnam Institute for Advanced Studies in Mathematics, Hanoi, Vietnam.
- 2016 :: Served on the thesis committee of Natasha Potashnik, Columbia University, New York City, New York.
- 2013 :: Served on the thesis committee of Zachary Maddock, Columbia University, New York City, New York.
- 2014 :: Served on the thesis committee of Xuanyu Pan, Columbia University, New York City, New York.
- 2013 :: Co-organised the poster session at the /Algebraic geometry north-eastern series (AGNES)/ conference Anand Patel, Boston College.
- 2011, 2010 :: Organised the student algebraic geometry seminar, Harvard/MIT.
:end:
