docs/cv.html
<div id="outline-container-orgb7c718d" class="outline-2">
<h2 id="orgb7c718d" class="collapsible">Service</h2>
<div class="outline-text-2" id="text-orgb7c718d">
<dl class="org-dl">
<dt>*</dt><dd>Refereed for Journal of the European Mathematical Society, Journal of Differential Geometry, Journal of Algebraic Geometry, Annales Scientifiques de l&rsquo;École Normale Supérieure, Mathematische Annalen, Algebra and Number Theory, Journal für die reine und angewandte Mathematik, manuscripta mathematica, Advances in Geometry, Mathematical Research Letters, European Journal of Mathematics, Journal de l&rsquo;École polytechnique — Mathématiques, Experimental mathematics.</dd>
<dt>*</dt><dd>Reviewed for Mathematical Reviews, American Mathematical Society.</dd>
<dt>2021--</dt><dd>Convener for the Masters program, Mathematical Sciences Institute, Australian National University.</dd>
<dt>2025</dt><dd>Headed the selection committee for the <i>Future research talent fellowship</i>, Australian National University.</dd>
<dt>---</dt><dd>Served on the thesis committee of Kabeer Manali Rahul, Australian National University.</dd>
<dt>2024</dt><dd>Co-organised the session <i>Computations and applications of commutative algebra and algebraic geometry</i> at the joint <i>NZMS-AustMS-AMS</i> meeting John Cobb, Sione Ma&rsquo;u, and Hal Schenk, University of Auckland.</dd>
<dt>2022</dt><dd>Co-organised the workshop <i>Braids in Symplectic and Algebraic Geometry</i> Inanc Baykur, Benson Farb, Anthony Licata, and Ailsa Keating, Institute for Computational and Experimental Research in Mathematics (ICERM), Brown University.</dd>
<dt>2021</dt><dd>Served on the award committee for the <i>BH Neumann prize</i> for the best student talk, AustMS meeting.</dd>
<dt>2020</dt><dd>Served on the thesis committee of Abhishek Bharadwaj, Mathematical Sciences Institute, Australian National University.</dd>
<dt>2019</dt><dd>Served on the selection committee for the <i>Future research talent fellowship</i>, Mathematical Sciences Institute, Australian National University.</dd>
<dt>---</dt><dd>Served on the director search committee, Mathematical Sciences Institute, Australian National University.</dd>
<dt>---</dt><dd>Served on the formal liaison committee, Mathematical Sciences Institute, Australian National University.</dd>
<dt>2018</dt><dd>Served on the award committee for the <i>BH Neumann prize</i> for the best student talk, AustMS meeting.</dd>
<dt>---</dt><dd>Co-organised the workshop <i>Polynomial Algebraic Developments in Optimisation and Computation</i> Markus Hegland.</dd>
<dt>---</dt><dd>Conducted training sessions in algebraic geometry at the <i>D21 Workshop</i>, Australian Signals Directorate.</dd>
<dt>2017</dt><dd>Co-organised the workshop <i>Stability and moduli spaces</i> Maksym Fedorchuk, Ian Morrison, Xiaowei Wang, American Institute of Matheatics, Palo Alto, California.</dd>
<dt>2016</dt><dd>Co-organised the <i>Summer workshop in algebraic geometry</i> Angela Gibney, Nicola Tarasca, University of Georgia, Athens, Georgia.</dd>
<dt>---</dt><dd>Organised the <i>Fairly informal reading seminar and tea (FIRST)</i>, University of Georgia, Athens, Georgia.</dd>
<dt>---</dt><dd>Co-organised the graduate student algebraic geometry seminar Johan de Jong, Columbia University.</dd>
<dt>2015</dt><dd>Conducted preparation sessions for the Putnam competition, Columbia University.</dd>
<dt>2014</dt><dd>Lectured in the <i>Workshop on birational geometry and stability of moduli stacks and spaces of curves</i>, Vietnam Institute for Advanced Studies in Mathematics, Hanoi, Vietnam.</dd>
<dt>2016</dt><dd>Served on the thesis committee of Natasha Potashnik, Columbia University, New York City, New York.</dd>
<dt>2013</dt><dd>Served on the thesis committee of Zachary Maddock, Columbia University, New York City, New York.</dd>
<dt>2014</dt><dd>Served on the thesis committee of Xuanyu Pan, Columbia University, New York City, New York.</dd>
<dt>2013</dt><dd>Co-organised the poster session at the <i>Algebraic geometry north-eastern series (AGNES)</i> conference Anand Patel, Boston College.</dd>
<dt>2011, 2010</dt><dd>Organised the student algebraic geometry seminar, Harvard/MIT.</dd>
</dl>
</div>
</div>
</div>
<div id="postamble" class="status">
Created by <a href="https://www.gnu.org/software/emacs/">Emacs</a> 30.1 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).  Last modified: 2025-04-11 Fri 16:23.  <a href="https://github.com/deopurkar/deopurkar.github.io">Source</a>
</div>
</body>
</html>
