docs/cv.tex
\section*{Service}
\label{sec:orgede8794}
\phantomsection
\label{orgdd2ea75}
\begin{description}
\item[{*}] Refereed for Journal of the European Mathematical Society, Journal of Differential Geometry, Journal of Algebraic Geometry, Annales Scientifiques de l'École Normale Supérieure, Mathematische Annalen, Algebra and Number Theory, Journal für die reine und angewandte Mathematik, manuscripta mathematica, Advances in Geometry, Mathematical Research Letters, European Journal of Mathematics, Journal de l'École polytechnique — Mathématiques, Experimental mathematics.
\item[{*}] Reviewed for Mathematical Reviews, American Mathematical Society.
\item[{2021--}] Convener for the Masters program, Mathematical Sciences Institute, Australian National University.
\item[{2025}] Headed the selection committee for the \emph{Future research talent fellowship}, Australian National University.
\item[{---}] Served on the thesis committee of Kabeer Manali Rahul, Australian National University.
\item[{2024}] Co-organised the session \emph{Computations and applications of commutative algebra and algebraic geometry} at the joint \emph{NZMS-AustMS-AMS} meeting John Cobb, Sione Ma'u, and Hal Schenk, University of Auckland.
\item[{2022}] Co-organised the workshop \emph{Braids in Symplectic and Algebraic Geometry} Inanc Baykur, Benson Farb, Anthony Licata, and Ailsa Keating, Institute for Computational and Experimental Research in Mathematics (ICERM), Brown University.
\item[{2021}] Served on the award committee for the \emph{BH Neumann prize} for the best student talk, AustMS meeting.
\item[{2020}] Served on the thesis committee of Abhishek Bharadwaj, Mathematical Sciences Institute, Australian National University.
\item[{2019}] Served on the selection committee for the \emph{Future research talent fellowship}, Mathematical Sciences Institute, Australian National University.
\item[{---}] Served on the director search committee, Mathematical Sciences Institute, Australian National University.
\item[{---}] Served on the formal liaison committee, Mathematical Sciences Institute, Australian National University.
\item[{2018}] Served on the award committee for the \emph{BH Neumann prize} for the best student talk, AustMS meeting.
\item[{---}] Co-organised the workshop \emph{Polynomial Algebraic Developments in Optimisation and Computation} Markus Hegland.
\item[{---}] Conducted training sessions in algebraic geometry at the \emph{D21 Workshop}, Australian Signals Directorate.
\item[{2017}] Co-organised the workshop \emph{Stability and moduli spaces} Maksym Fedorchuk, Ian Morrison, Xiaowei Wang, American Institute of Matheatics, Palo Alto, California.
\item[{2016}] Co-organised the \emph{Summer workshop in algebraic geometry} Angela Gibney, Nicola Tarasca, University of Georgia, Athens, Georgia.
\item[{---}] Organised the \emph{Fairly informal reading seminar and tea (FIRST)}, University of Georgia, Athens, Georgia.
\item[{---}] Co-organised the graduate student algebraic geometry seminar Johan de Jong, Columbia University.
\item[{2015}] Conducted preparation sessions for the Putnam competition, Columbia University.
\item[{2014}] Lectured in the \emph{Workshop on birational geometry and stability of moduli stacks and spaces of curves}, Vietnam Institute for Advanced Studies in Mathematics, Hanoi, Vietnam.
\item[{2016}] Served on the thesis committee of Natasha Potashnik, Columbia University, New York City, New York.
\item[{2013}] Served on the thesis committee of Zachary Maddock, Columbia University, New York City, New York.
\item[{2014}] Served on the thesis committee of Xuanyu Pan, Columbia University, New York City, New York.
\item[{2013}] Co-organised the poster session at the \emph{Algebraic geometry north-eastern series (AGNES)} conference Anand Patel, Boston College.
\item[{2011, 2010}] Organised the student algebraic geometry seminar, Harvard/MIT.
\end{description}
\end{document}
